tap "coursier/formulas"
tap "homebrew/bundle"
tap "stripe/stripe-cli"
brew "dotnet"
brew "exercism"
brew "fzf"
brew "gh"
brew "git"
brew "unbound"
brew "gnutls"
brew "htop"
brew "nmap"
brew "node"
brew "postgresql@15", link: true
brew "tfenv"
brew "tree"
brew "wget"
brew "wireshark"
brew "coursier/formulas/coursier"
brew "stripe/stripe-cli/stripe"
cask "fig"
cask "temurin"
vscode "4ops.terraform"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "dskwrk.vscode-generate-getter-setter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "johnpapa.vscode-peacock"
vscode "lkytal.pomodoro"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "steoates.autoimport"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
